#Область ПрограммныйИнтерфейс

// Функция - Простое чтение JSON
// Функция преобразует строку JSON в структуру 1С
// Параметры:
//  стрДанные	  -	Строка - Строка в формате JS
// 
// Возвращаемое значение:
//  Структура - Результат преоборазования
//
Функция ПростоеЧтениеJSON(стрДанные) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(стрДанные);
	
	стДанные = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат стДанные;
	
КонецФункции

// Функция - Простая запись JSON
// Функция преобразует структуру 1С в строку JSON
// Параметры:
//  стДанные	  -	Строка - Структура данных 1С
// 
// Возвращаемое значение:
//  Строка в JS - Результат преоборазования
//
Функция ПростаяЗаписьJSON(стДанные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, стДанные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Функция - Чтение прикладных объектов JSON
// Функция преобразует строку JSON в структуру 1С, содержащую ссылки на прикладные объекты
// Параметры:
//  стрДанные	  -	Строка - Строка в формате JS
// 
// Возвращаемое значение:
//  Структура - Результат преоборазования
//
Функция ЧтениеПрикладныхОбъектовJSON(стрДанные) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(стрДанные);
	
	стДанные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат стДанные;
	
КонецФункции

// Функция - Запись прикладных объектов JSON
// Функция преобразует структуру 1С, содержащую ссылки на прикладные объекты, в строку JSON
// Параметры:
//  стДанные	  -	Строка - Структура данных 1С, содержащая ссылки на прикладные объекты
// 
// Возвращаемое значение:
//  Строка в JS - Результат преоборазования
//
Функция ЗаписьПрикладныхОбъектовJSON(стДанные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, стДанные, НазначениеТипаXML.Явное);	//сериализуем объект в JSON
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

#КонецОбласти