&НаКлиенте
Функция мПросмотрФайлаВОбработкеJSON(пИмяФайла="", пТекстJSON="")
	// Сначала надо проинициализировать ее на сервере!!!
	
	/////
	//23.06.01 Волков А. СШП
	//лФормаОбработки=ПолучитьФорму("ВнешняяОбработка.ТюнсофтРедактированиеJSON.Форма");
	
	лФормаОбработки=ПолучитьФорму("Обработка.ТюнсофтРедактированиеJSON.Форма");
	
	//23.06.01 Волков А. СШП
	/////
	
	лФормаОбработки.Открыть();
	Если ЗначениеЗаполнено(пИмяФайла) Тогда // так чтобы при повторном открытии обновлялась форма
		лФормаОбработки.ФайлПрочитать(пИмяФайла); 
	Иначе
		лФормаОбработки.ЗаполнитьТекст(пТекстJSON);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОткрытьРедактированиеТекста(Команда)
	мПросмотрФайлаВОбработкеJSON(, ТекстJSON);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедактированиеФайла(Команда)
	мПросмотрФайлаВОбработкеJSON(ИмяФайла);
КонецПроцедуры
