&НаСервере
Функция мЗначениеОтобразить(пДеревоЗначений, пЗначение)
	лЭлементы=пДеревоЗначений.ПолучитьЭлементы();
	Если ТипЗнч(пЗначение)=Тип("Структура") Тогда
		Для Каждого лКлючИЗначение Из пЗначение Цикл
			лДеревоЗначенийУзел=лЭлементы.Добавить();
			лДеревоЗначенийУзел.Имя=лКлючИЗначение.Ключ;
			лДеревоЗначенийУзел.Тип=ТипЗнч(лКлючИЗначение.Значение);
			лДеревоЗначенийУзел.Значение=лКлючИЗначение.Значение;
			мЗначениеОтобразить(лДеревоЗначенийУзел, лКлючИЗначение.Значение);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(пЗначение)=Тип("СписокЗначений") Тогда
		лНомер=0;
		Для Каждого лЭлементСпискаЗначений Из пЗначение Цикл
			лНомер=лНомер+1;
			лДеревоЗначенийУзел=лЭлементы.Добавить();
			лДеревоЗначенийУзел.Имя=лНомер;
			лДеревоЗначенийУзел.Тип=ТипЗнч(лЭлементСпискаЗначений.Значение);
			лДеревоЗначенийУзел.Значение=лЭлементСпискаЗначений.Значение;
			мЗначениеОтобразить(лДеревоЗначенийУзел, лЭлементСпискаЗначений.Значение);
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мЗначениеОтобразить(ДеревоЗначений, Параметры.Значение)
КонецПроцедуры
