#Область ОбщиеПроцедурыИФункции

// Вовзращает количество попыток
//
Функция ПолучитьКоличествоПопытокПередачиОбъекта() Экспорт
	
	// Значение по умолчанию
	КоличествоПопыток = 50;
	
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеКонстанты = Константы.сшпКоличествоПопытокПередачиОбъекта.Получить();
	
	Если ЗначениеЗаполнено(ЗначениеКонстанты) Тогда
		
		КоличествоПопыток = ЗначениеКонстанты;
		
	КонецЕсли;
	
	Возврат КоличествоПопыток;
	
КонецФункции

// Вовзращает код текущей инфосистемы - код отправителя
//
Функция ПолучитьКодТекущейИнфосистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеКонстанты = СокрЛП(Константы.сшпКодТекущейИнфосистемы.Получить());
	
	Возврат ЗначениеКонстанты;
	
КонецФункции

#КонецОбласти