#Область ОбщиеПроцедурыИФункции

// Возвращает локализованное имя события журнала регистрации для СШП.
//
// Параметры:
//   СобытиеВторогоУровня - Строка - имя события, добавляемое через точку к имени события по умолчанию.
//
// Возвращаемое значение:
//   Строка - Сервисная шина предприятия
//        или Сервисная шина предприятия.<ИмяСобытияВторогоУровня>.
//
Функция ИмяСобытияЖурналаРегистрации(СобытиеВторогоУровня = "") Экспорт
	
	Если ПустаяСтрока(СобытиеВторогоУровня) Тогда
		
		Возврат НСтр("ru = 'Сервисная шина предприятия'", КодОсновногоЯзыка());
		
	Иначе
		
		Возврат СтрШаблон("%1.%2", НСтр("ru = 'Сервисная шина предприятия'", КодОсновногоЯзыка()), СобытиеВторогоУровня);
		
	КонецЕсли;
	
КонецФункции

// Возвращает код основного языка информационной базы, например "ru".
// На котором программно записываются автогенерируемые строки в информационную базу.
// Например, при начальном заполнении информационной базы данными из макета, автогенерации комментария
// к проводке или определении значения параметра ИмяСобытия метода ЗаписьЖурналаРегистрации.
//
// Возвращаемое значение:
//  Строка
//
Функция КодОсновногоЯзыка() Экспорт
	
	Возврат Метаданные.ОсновнойЯзык.КодЯзыка;
	
КонецФункции

// Функция - Получить объекты интеграции
//	Возвращает массив объектов метаданных участвующих в интеграции СШП.
//	Для этого используется определяемый тип - сшпОбъектыИнтеграции.
//
Функция ПолучитьОбъектыИнтеграции() Экспорт
	
	мвОМ = Новый Массив;
	
	мвТипов = Метаданные.ОпределяемыеТипы.сшпОбъектыИнтеграции.Тип.Типы();
	Для Каждого ТекТип Из мвТипов цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТекТип);
		
		мвОМ.Добавить(ОбъектМетаданных.ПолноеИмя());
		
	КонецЦикла;
	
	Возврат мвОМ;
	
КонецФункции

#КонецОбласти